'''
Q:输出象棋盘中将帅的所有位置，要求：只能出现一个变量。
'''
import math

#方法1.需要去重
# for i in range(1,82):
#     print('A=', (i % 9 + 1), 'B=', (i % 9 + 1))
#     print('A=', (i % 9 + 1), 'B=', ((i % 9 + 1)+3)%9)
#     if (i % 9 + 1)==3:
#         print('A=', (i % 9 + 1), 'B=', ((i % 9 + 1) + 6))
#     elif (i % 9 + 1)==6:
#         print('A=', (i % 9 + 1), 'B=', ((i % 9 + 1) + 3))

#方法2，不必去重。
#i为81-73时，左侧向上取整为9。右侧取余为0，8-1，左右两边都是取3的余数相等，则输出。
#但注意(i%9)==0时，应该是9，但是取9的余本身不能到9，因此需要处理。
for i in range(1,82):
    if (math.ceil(i/9)%3)  != ((i%9)%3):
        continue
    if ((i%9))==0:
        print('A=',math.ceil(i/9),'B=',(i-1)%9+1)
    else:
        print('A=', math.ceil(i / 9), 'B=', i % 9 )     